# GetSupportedEngines Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudEngineRegistry..::..GetSupportedEngines Method
PointCloudEngineRegistry Class See Also
---
Returns a list of the identifiers supported by point cloud engines registered to Revit.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static IList<string> GetSupportedEngines()
```

Visual Basic
---
```text
Public Shared Function GetSupportedEngines As IList(Of String)
```

Visual C++
---
```text
public:
static IList<String^>^ GetSupportedEngines()
```

# ### Return Value
The list of identifiers.
# See Also
PointCloudEngineRegistry Class
Autodesk.Revit.DB.PointClouds Namespace